<template>
  <Header type="about" />
  <div
    class="flex flex-col gap-[52px] px-[130px] mb-12"
  >
    <iframe
      width="1712"
      height="730"
      src="https://www.youtube.com/embed/LBrdha1eXF4?si=o4tjvYkm7Pa9v9cA&amp;controls=0"
      title="YouTube video player"
      frameborder="0"
      allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
      allowfullscreen
    ></iframe>
    <p class="text-[106px]">Двери открыты!</p>
    <div class="px-[66px] py-[32px] bg-white shadow-custom rounded-3xl">
      <p class="text-[80px]">Гимназия №4: Открывая Двери Знаний!</p>
      <p class="text-[40px] font-light">
        "Открытие дверей знаний" в Гимназии №4 представляет собой захватывающее
        путешествие в мир учебы, исследований и саморазвития. У нас это не
        просто образование, а ключ к бескрайнему океану знаний, который каждый
        ученик может исследовать, расширяя свой кругозор и глубже погружаясь в
        увлекательные сферы науки и культуры.

        <br />В нашей гимназии каждая дверь, открываемая учениками, ведет к
        новому уровню понимания и освоения предметов. Мы стремимся создать
        атмосферу, в которой учеба не является обязанностью, а увлекательным
        приключением. Ведь именно в процессе открытия знаний лежит суть
        образования. <br />Мы понимаем, что каждый ученик уникален, и поэтому
        предлагаем индивидуальный подход к обучению. Команда преподавателей
        готова поддерживать и направлять каждого студента, помогая им открывать
        двери своих способностей и талантов.

        <br />В Гимназии №4 ученики имеют возможность выбирать из множества
        образовательных программ, отвечающих самым разным интересам. Это не
        только учебные предметы, но и кружки, мастер-классы и проекты, которые
        помогут им расширить свой кругозор и обрести глубокие знания в
        интересующих областях.
      </p>
    </div>
  </div>
  <Footer />
</template>

<script setup lang="ts">
import Header from "../components/Header.vue";
import Footer from "../components/Footer.vue";
</script>

<style scoped>
.shadow-custom {
  box-shadow: -1px 2px 56.5px 7px rgba(157.25, 157.25, 157.25, 0.6);
}
</style>