<template>
  <Header type="learn" />
  <div class="px-[130px] flex flex-col gap-12 pb-10">
    <p class="text-[100px]">Мы вас ждём!</p>
    <div class="px-[66px] py-[32px] bg-white shadow-custom rounded-3xl">
      <p class="text-[80px]">Какова особенность обучения в Гимназии №4?</p>
      <p class="text-[40px] font-light">
        В Гимназии №4 мы стремимся создать уникальную образовательную среду,
        которая поддерживает разностороннее развитие каждого ученика. Одной из
        ключевых особенностей нашей гимназии является акцент на
        индивидуализированном обучении. Мы учитываем индивидуальные потребности,
        интересы и стили обучения каждого ученика, предоставляя
        персонализированный подход к образованию.<br />Кроме того, Гимназия №4
        предлагает богатый набор дополнительных образовательных программ,
        включая кружки, секции и мероприятия, чтобы расширить горизонты учеников
        и помочь им раскрыть свой потенциал в различных областях. <br />Наш
        профессиональный педагогический коллектив поощряет творческое мышление,
        самостоятельность и ответственность, формируя личности, способные
        успешно адаптироваться в современном мире.<br />Если вы ищете школу, где
        ваш ребенок сможет не только получить качественное образование, но и
        развивать свои уникальные таланты, то Гимназия №4 - ваш выбор!
      </p>
    </div>
  </div>
  <Footer />
</template>

<script setup lang="ts">
import Header from "../components/Header.vue";
import Footer from "../components/Footer.vue";
</script>

<style scoped>
.shadow-custom {
  box-shadow: -1px 2px 56.5px 7px rgba(157.25, 157.25, 157.25, 0.6);
}
</style>
